01_snowfoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "(snowDriftDensity)"
    {
        solver          GAMG;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 200;
        tolerance       1e-12; // 1e-12;
        relTol          0.05;
        smoother        DILUGaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        nVcycles        1;
        minIter     1;
    }


    "(snowDriftDensity|snowDepth)Final"
    {
        $snowDriftDensity;
        tolerance       1e-7; //1e-12;
        relTol          0.0;
        minIter     1;      
    }

    "(p|Phi|pcorr|yPsi)"
    {
        solver          GAMG;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 200;
        tolerance       1e-12;
        relTol          0.05;
        smoother        DICGaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        nVcycles        1;
        //minIter     1;
        // froze fluid
        maxIter 0; 
    }

    "(p|rho)Final"
    {
        $p;
        tolerance       1e-12;
        relTol          0.0;
        //minIter     1;
        // froze fluid
        maxIter 0; 
    };


    "(h|epsilon|k|e|nuTilda|U)"
    {
        solver           smoothSolver;
        smoother         symGaussSeidel;
        tolerance        1e-20;
        relTol           0.01;
        nSweeps          1;
        // froze fluid
        maxIter 0; 
    }

    
    "(hFinal|epsilonFinal|kFinal|eFinal|nuTildaFinal|UFinal)"
    
    {
        solver           smoothSolver;
        smoother         symGaussSeidel;
        tolerance        1e-10;
        relTol           0.0;
        nSweeps          1;
        // froze fluid
        maxIter 0; 
    }


      ".*(rho|rhoFinal)"
    {
        solver          diagonal;
        maxIter 0;
    }


}

relaxationFactors
{
    default         0.95;
    U               0.95;
    rho             0.95;
    p               0.95;
    h               0.95;   
    e               0.9; 
    snowDriftDensity 0.9;
    snowDriftDensityFinal 1;       
    pFinal          1;
    UFinal          1;
    eFinal          1;
    nuTildaFinal    1;
    kFinal          1;
    omegaFinal      1;
    hFinal          1;
    epsilonFinal    1;
    rhoFinal        1;      
}


PIMPLE
{
// faster run lower stability

    momentumPredictor off;
    nOuterCorrectors  3; //1;  // 2;
    nCorrectors     2;
    finalOnLastPimpleIterOnly   false; // true;
    nNonOrthogonalCorrectors 0;
    pMax            1.2e5;
    pMin            0.8e5;

// slower run higher stability 
/*    
    nOuterCorrectors 7;
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    transonic       no;
    consistent       no;
    correctPhi      yes;
    momentumPredictor   yes;
    pMaxFactor         10.0;
    pMinFactor         0.2;
*/    
}

relaxationFactors
{
    default          0.95;
    U                0.95;
    rho              0.95;
    p                0.95;
    h                0.95;   
    e                0.9; 
    snowDriftDensity 0.9;      
    pFinal           1;
    UFinal           1;
    eFinal           1;
    nuTildaFinal     1;
    kFinal           1;
    omegaFinal       1;
    hFinal           1;
    epsilonFinal     1;
    rhoFinal         1;      
}


// ************************************************************************* //
